In [1]:
import pandas as pd
import sqlite3
conn = sqlite3.connect("workout_app.db")
cursor = conn.cursor()

Create _user_ table

In [4]:
cursor.execute("""CREATE TABLE IF NOT EXISTS user (
               user_id INTEGER PRIMARY KEY AUTOINCREMENT,
               first_name VARCHAR(50) NOT NULL,
               last_name VARCHAR(50) NOT NULL,
               address VARCHAR(50),
               town VARCHAR(50),
               state VARCHAR(50),
               country VARCHAR(50),
               email VARCHAR(50) UNIQUE NOT NULL,
               phone_number VARCHAR(50),
               password_hash VARCHAR(100) NOT NULL,
               date_of_birth DATE,
               height DECIMAL(5,2),
               date_registered DATE DEFAULT CURRENT_DATE,
               date_unregistered DATE,
               registered BOOLEAN,
               fitness_goal VARCHAR(50),
               user_type VARCHAR(50)
               )""")

In [5]:
cursor.executemany("""INSERT INTO user (first_name, last_name, email, password_hash, phone_number, height, user_type, fitness_goal, date_registered, registered)
VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)""", [
    ('John', 'Doe', 'john@email.com', 'hashed_pw_123', '555-0123', 70.0, 'regular', 'strength', '2025-01-15', 1),
    ('Jane', 'Smith', 'jane@email.com', 'hashed_pw_456', '555-0456', 65.5, 'beginner', 'weight_loss', '2025-02-01', 1),
    ('Mike', 'Johnson', 'mike@email.com', 'hashed_pw_789', '555-0789', 72.0, 'athlete', 'strength', '2025-03-10', 1)
])
conn.commit()

pd.read_sql("SELECT * FROM user", conn)

,user_id,first_name,last_name,address,town,state,country,email,phone_number,password_hash,date_of_birth,height,date_registered,date_unregistered,registered,fitness_goal,user_type
0,1,John,Doe,None,None,None,None,john@email.com,555-0123,hashed_pw_123,None,70.0,2025-01-15,None,1,strength,regular
1,2,Jane,Smith,None,None,None,None,jane@email.com,555-0456,hashed_pw_456,None,65.5,2025-02-01,None,1,weight_loss,beginner
2,3,Mike,Johnson,None,None,None,None,mike@email.com,555-0789,hashed_pw_789,None,72.0,2025-03-10,None,1,strength,athlete

Create _user_stats_log_ table

In [6]:
cursor.execute("""CREATE TABLE IF NOT EXISTS user_stats_log (
               log_id INTEGER PRIMARY KEY AUTOINCREMENT,
               user_id INT NOT NULL,
               date DATE NOT NULL,
               weight DECIMAL(5,2) NOT NULL,
               neck DECIMAL(4,2),
               waist DECIMAL(5,2),
               hips DECIMAL(5,2),
               body_fat_percentage DECIMAL(4,2),
               notes TEXT,
               FOREIGN KEY (user_id) REFERENCES user(user_id) ON DELETE CASCADE
               )""")

In [7]:
cursor.executemany("""INSERT INTO user_stats_log (user_id, date, weight, waist, body_fat_percentage, notes)
VALUES (?, ?, ?, ?, ?, ?)""", [
    (1, '2025-10-01', 185.5, 34.0, 18.5, ''),
    (1, '2025-10-08', 184.0, 33.5, 18.0, ''),
    (2, '2025-10-01', 152.0, 28.0, 24.5, ''),
    (2, '2025-10-08', 151.0, 27.5, 24.0, ''),
    (3, '2025-10-01', 195.0, 32.0, 15.0, '')
])


pd.read_sql("SELECT * FROM user_stats_log", conn)

,log_id,user_id,date,weight,neck,waist,hips,body_fat_percentage,notes
0,1,1,2025-10-01,185.5,None,34.0,None,18.5,
1,2,1,2025-10-08,184.0,None,33.5,None,18.0,
2,3,2,2025-10-01,152.0,None,28.0,None,24.5,
3,4,2,2025-10-08,151.0,None,27.5,None,24.0,
4,5,3,2025-10-01,195.0,None,32.0,None,15.0,

Create _exercise_ table

In [8]:
cursor.execute("""CREATE TABLE IF NOT EXISTS exercise (
               exercise_id INTEGER PRIMARY KEY AUTOINCREMENT,
               name VARCHAR(100) UNIQUE NOT NULL,
               type VARCHAR(50) NOT NULL,
               subtype VARCHAR(50),
               equipment VARCHAR(50),
               difficulty INT CHECK (difficulty BETWEEN 1 AND 5),
               description TEXT,
               demo_link VARCHAR(100)
               )""")

In [9]:
cursor.executemany("""INSERT INTO exercise (name, type, subtype, equipment, difficulty, description, demo_link)
VALUES (?, ?, ?, ?, ?, ?, ?)""", [
    ('Barbell Bench Press', 'strength', 'compound', 'barbell', 3, 'Press bar from chest to full extension', 'https://youtube.com/bench-press'),
    ('Barbell Back Squat', 'strength', 'compound', 'barbell', 4, 'Squat with bar on back', 'https://youtube.com/back-squat'),
    ('Pull-ups', 'strength', 'compound', 'bodyweight', 4, 'Pull chin over bar', 'https://youtube.com/pullups'),
    ('Running', 'cardio', 'steady_state', 'none', 2, 'Cardiovascular running exercise', None),
    ('Plank', 'flexibility', 'isometric', 'bodyweight', 2, 'Hold straight body position', 'https://youtube.com/plank'),
    ('Deadlift', 'strength', 'compound', 'barbell', 5, 'Lift bar from ground to standing', 'https://youtube.com/deadlift'),
    ('Overhead Press', 'strength', 'compound', 'barbell', 4, 'Press bar overhead', 'https://youtube.com/ohp')
])
conn.commit()

pd.read_sql("SELECT * FROM exercise", conn)

,exercise_id,name,type,subtype,equipment,difficulty,description,demo_link
0,1,Barbell Bench Press,strength,compound,barbell,3,Press bar from chest to full extension,https://youtube.com/bench-press
1,2,Barbell Back Squat,strength,compound,barbell,4,Squat with bar on back,https://youtube.com/back-squat
2,3,Pull-ups,strength,compound,bodyweight,4,Pull chin over bar,https://youtube.com/pullups
3,4,Running,cardio,steady_state,none,2,Cardiovascular running exercise,None
4,5,Plank,flexibility,isometric,bodyweight,2,Hold straight body position,https://youtube.com/plank
5,6,Deadlift,strength,compound,barbell,5,Lift bar from ground to standing,https://youtube.com/deadlift
6,7,Overhead Press,strength,compound,barbell,4,Press bar overhead,https://youtube.com/ohp

Create _target_ table

In [10]:
cursor.execute("""CREATE TABLE IF NOT EXISTS target (
               target_id INTEGER PRIMARY KEY AUTOINCREMENT,
               target_name VARCHAR(50) UNIQUE NOT NULL,
               target_group VARCHAR(50),
               target_function VARCHAR(100)
               )""")

In [11]:
cursor.executemany("""INSERT INTO target (target_name, target_group, target_function)
VALUES (?, ?, ?)""", [
    ('Chest', 'Upper Body', 'Push'),
    ('Back', 'Upper Body', 'Pull'),
    ('Quadriceps', 'Lower Body', 'Legs'),
    ('Hamstrings', 'Lower Body', 'Legs'),
    ('Core', 'Core', 'Stability'),
    ('Biceps', 'Upper Body', 'Pull'),
    ('Triceps', 'Upper Body', 'Push'),
    ('Shoulders', 'Upper Body', 'Push'),
    ('Glutes', 'Lower Body', 'Legs'),
    ('Calves', 'Lower Body', 'Legs')
])
conn.commit()

pd.read_sql("SELECT * FROM target", conn)

   target_id target_name target_group target_function
0          1       Chest   Upper Body            Push
1          2        Back   Upper Body            Pull
2          3  Quadriceps   Lower Body            Legs
3          4  Hamstrings   Lower Body            Legs
4          5        Core         Core       Stability
5          6      Biceps   Upper Body            Pull
6          7     Triceps   Upper Body            Push
7          8   Shoulders   Upper Body            Push
8          9      Glutes   Lower Body            Legs
9         10      Calves   Lower Body            Legs

Code _exercise_target_association_ table

In [12]:
cursor.execute("""CREATE TABLE IF NOT EXISTS exercise_target_association (
               association_id INTEGER PRIMARY KEY AUTOINCREMENT,
               exercise_id INT NOT NULL,
               target_id INT NOT NULL,
               intensity VARCHAR(20) NOT NULL,
               FOREIGN KEY (exercise_id) REFERENCES exercise(exercise_id) ON DELETE CASCADE,
               FOREIGN KEY (target_id) REFERENCES target(target_id) ON DELETE CASCADE
               )""")

In [13]:
cursor.executemany("""INSERT INTO exercise_target_association (exercise_id, target_id, intensity)
VALUES (?, ?, ?)""", [
    (1, 1, 'primary'),
    (1, 7, 'secondary'),
    (1, 8, 'secondary'),
    (2, 3, 'primary'),
    (2, 4, 'secondary'),
    (2, 9, 'secondary'),
    (3, 2, 'primary'),
    (3, 6, 'secondary'),
    (5, 5, 'primary'),
    (6, 4, 'primary'),
    (6, 2, 'secondary'),
    (7, 8, 'primary'),
    (7, 7, 'secondary')
])
conn.commit()

pd.read_sql("SELECT * FROM exercise_target_association", conn)

    association_id  exercise_id  target_id  intensity
0                1            1          1    primary
1                2            1          7  secondary
2                3            1          8  secondary
3                4            2          3    primary
4                5            2          4  secondary
5                6            2          9  secondary
6                7            3          2    primary
7                8            3          6  secondary
8                9            5          5    primary
9               10            6          4    primary
10              11            6          2  secondary
11              12            7          8    primary
12              13            7          7  secondary

Create _user_pb_ table

In [14]:
cursor.execute("""CREATE TABLE IF NOT EXISTS user_pb (
               pr_id INTEGER PRIMARY KEY AUTOINCREMENT,
               user_id INT NOT NULL,
               exercise_id INT NOT NULL,
               pr_type VARCHAR(20) NOT NULL,
               pb_weight DECIMAL(6,2),
               pb_reps INTEGER,
               pb_time TIME,
               pb_date DATE NOT NULL,
               previous_pr DECIMAL(6,2),
               notes TEXT,
               FOREIGN KEY (user_id) REFERENCES user(user_id) ON DELETE CASCADE,
               FOREIGN KEY (exercise_id) REFERENCES exercise(exercise_id) ON DELETE CASCADE
               )""")

In [15]:
cursor.executemany("""INSERT INTO user_pb (user_id, exercise_id, pr_type, pb_weight, pb_reps, pb_date, previous_pr, notes)
VALUES (?, ?, ?, ?, ?, ?, ?, ?)""", [
    (1, 1, 'weight', 225.0, 1, '2025-09-15', 185.0, ''),
    (1, 1, 'weight', 185.0, 8, '2025-09-01', 0.0, ''),
    (2, 3, 'reps', None, 15, '2025-10-01', None, ''),
    (3, 2, 'weight', 405.0, 1, '2025-08-20', 365.0, ''),
    (3, 6, 'weight', 495.0, 1, '2025-09-10', None, '')
])


pd.read_sql("SELECT * FROM user_pb", conn)

,pr_id,user_id,exercise_id,pr_type,pb_weight,pb_reps,pb_time,pb_date,previous_pr,notes
0,1,1,1,weight,225.0,1,None,2025-09-15,185.0,
1,2,1,1,weight,185.0,8,None,2025-09-01,0.0,
2,3,2,3,reps,NaN,15,None,2025-10-01,NaN,
3,4,3,2,weight,405.0,1,None,2025-08-20,365.0,
4,5,3,6,weight,495.0,1,None,2025-09-10,NaN,

Create _workout_sessions_ table

In [16]:

cursor.execute("""CREATE TABLE IF NOT EXISTS workout_sessions (
               session_id INTEGER PRIMARY KEY AUTOINCREMENT,
               user_id INT NOT NULL,
               session_name VARCHAR(100),
               session_date DATE NOT NULL,
               start_time TIME,
               end_time TIME,
               duration_minutes INTEGER,
               bodyweight DECIMAL(5,2),
               completed BOOLEAN DEFAULT 1,
               is_template INTEGER DEFAULT 0,
               FOREIGN KEY (user_id) REFERENCES user(user_id) ON DELETE CASCADE
               )""")

In [17]:
cursor.executemany("""INSERT INTO workout_sessions (user_id, session_name, session_date, start_time, duration_minutes, bodyweight, completed, is_template)
VALUES (?, ?, ?, ?, ?, ?, ?, ?)""", [
    (1, 'Push Day', '2025-10-14', '18:00:00', 65, 185.5, 1, 1), 
    (1, 'Pull Day', '2025-10-16', '07:00:00', 55, 185.0, 1, 1), 
    (2, 'Full Body', '2025-10-15', '19:00:00', 45, 152.0, 1, 1),
    (3, 'Leg Day', '2025-10-14', '17:00:00', 75, 195.0, 1, 1)    
])
conn.commit()

pd.read_sql("SELECT * FROM workout_sessions", conn)

,session_id,user_id,session_name,session_date,start_time,end_time,duration_minutes,bodyweight,completed,is_template
0,1,1,Push Day,2025-10-14,18:00:00,None,65,185.5,1,1
1,2,1,Pull Day,2025-10-16,07:00:00,None,55,185.0,1,1
2,3,2,Full Body,2025-10-15,19:00:00,None,45,152.0,1,1
3,4,3,Leg Day,2025-10-14,17:00:00,None,75,195.0,1,1

Create _session_exercises_ table

In [18]:
cursor.execute("""CREATE TABLE IF NOT EXISTS session_exercises (
               session_exercise_id INTEGER PRIMARY KEY AUTOINCREMENT,
               session_id INT NOT NULL,
               exercise_id INT NOT NULL,
               exercise_order INT NOT NULL,
               target_sets INTEGER,
               target_reps INTEGER,
               completed BOOLEAN DEFAULT 1,
               FOREIGN KEY (session_id) REFERENCES workout_sessions(session_id) ON DELETE CASCADE,
               FOREIGN KEY (exercise_id) REFERENCES exercise(exercise_id) ON DELETE CASCADE
               )""")

In [19]:

cursor.executemany("""INSERT INTO session_exercises (session_id, exercise_id, exercise_order, target_sets, target_reps, completed)
VALUES (?, ?, ?, ?, ?, ?)""", [
    (1, 1, 1, 3, 8, 1),
    (1, 7, 2, 3, 12, 1),
    (2, 3, 1, 4, 10, 1),
    (2, 6, 2, 3, 5, 1),
    (3, 2, 1, 4, 10, 1),
    (3, 5, 2, 3, 60, 1),
    (4, 2, 1, 5, 5, 1)
])
conn.commit()

pd.read_sql("SELECT * FROM session_exercises", conn)

,session_exercise_id,session_id,exercise_id,exercise_order,target_sets,target_reps,completed
0,1,1,1,1,3,8,1
1,2,1,7,2,3,12,1
2,3,2,3,1,4,10,1
3,4,2,6,2,3,5,1
4,5,3,2,1,4,10,1
5,6,3,5,2,3,60,1
6,7,4,2,1,5,5,1

Create _sets_ table

In [20]:
cursor.execute("""CREATE TABLE IF NOT EXISTS sets (
               set_id INTEGER PRIMARY KEY AUTOINCREMENT,
               session_exercise_id INT NOT NULL,
               set_number INT NOT NULL,
               weight DECIMAL(6,2),
               reps INTEGER,
               rpe INT CHECK (rpe BETWEEN 1 AND 10),
               completed BOOLEAN DEFAULT 1,
               is_warmup BOOLEAN, 
               completion_time DATETIME,
               FOREIGN KEY (session_exercise_id) REFERENCES session_exercises(session_exercise_id) ON DELETE CASCADE
               )""")

In [21]:
cursor.executemany("""INSERT INTO sets (
    session_exercise_id, set_number, weight, reps, rpe, completed, is_warmup, completion_time
) VALUES (?, ?, ?, ?, ?, ?, ?, ?)""", [
    (1, 1, 185.0, 10, 7, 1, 0, None),
    (1, 2, 185.0, 9, 8, 1, 0, None),
    (1, 3, 185.0, 8, 9, 1, 0, None),
    (2, 1, 95.0, 12, 7, 1, 0, None),
    (2, 2, 95.0, 11, 8, 1, 0, None),
    (2, 3, 95.0, 10, 9, 1, 0, None),
    (3, 1, None, 12, 8, 1, 0, None),
    (3, 2, None, 10, 9, 1, 0, None),
    (3, 3, None, 8, 9, 1, 0, None),
    (3, 4, None, 6, 10, 1, 0, None),
    (4, 1, 315.0, 5, 8, 1, 0, None),
    (4, 2, 315.0, 5, 9, 1, 0, None),
    (4, 3, 315.0, 5, 9, 1, 0, None),
    (5, 1, 185.0, 10, 7, 1, 0, None),
    (5, 2, 185.0, 10, 8, 1, 0, None),
    (5, 3, 185.0, 10, 8, 1, 0, None),
    (5, 4, 185.0, 10, 9, 1, 0, None),
    (7, 1, 365.0, 5, 8, 1, 0, None),
    (7, 2, 365.0, 5, 9, 1, 0, None),
    (7, 3, 365.0, 5, 9, 1, 0, None),
    (7, 4, 365.0, 5, 10, 1, 0, None),
    (7, 5, 365.0, 5, 10, 1, 0, None)
])
conn.commit()

'''
cursor.executemany("""INSERT INTO sets (session_exercise_id, set_number, weight, reps, rpe, completed, is_warmup, completion_time)
VALUES (?, ?, ?, ?, ?, ?, ?, ?)""", [
    (1, 1, 185.0, 10, 7, 1, 0, None),
    (1, 2, 185.0, 9, 8, 1, 0, None),
    ...
])
'''

pd.read_sql("SELECT * FROM sets", conn)

,set_id,session_exercise_id,set_number,weight,reps,rpe,completed,is_warmup,completion_time
0,1,1,1,185.0,10,7,1,0,None
1,2,1,2,185.0,9,8,1,0,None
2,3,1,3,185.0,8,9,1,0,None
3,4,2,1,95.0,12,7,1,0,None
4,5,2,2,95.0,11,8,1,0,None
5,6,2,3,95.0,10,9,1,0,None
6,7,3,1,NaN,12,8,1,0,None
7,8,3,2,NaN,10,9,1,0,None
8,9,3,3,NaN,8,9,1,0,None
9,10,3,4,NaN,6,10,1,0,None
10,11,4,1,315.0,5,8,1,0,None
11,12,4,2,315.0,5,9,1,0,None
12,13,4,3,315.0,5,9,1,0,None
13,14,5,1,185.0,10,7,1,0,None
14,15,5,2,185.0,10,8,1,0,None
15,16,5,3,185.0,10,8,1,0,None
16,17,5,4,185.0,10,9,1,0,None
17,18,7,1,365.0,5,8,1,0,None
18,19,7,2,365.0,5,9,1,0,None
19,20,7,3,365.0,5,9,1,0,None
20,21,7,4,365.0,5,10,1,0,None
21,22,7,5,365.0,5,10,1,0,None

Create _goals_ table

In [22]:
cursor.execute("""CREATE TABLE IF NOT EXISTS goals (
               goal_id INTEGER PRIMARY KEY AUTOINCREMENT,
               user_id INT NOT NULL,
               goal_type VARCHAR(100) NOT NULL CHECK(goal_type IN ('PR','bodyweight','frequency','strength','endurance','consistency')),
               goal_description TEXT,
               target_value DECIMAL(8,2) NOT NULL,
               current_value DECIMAL(8,2),
               unit VARCHAR(20) NOT NULL,
               exercise_id INTEGER,
               start_date DATE NOT NULL,
               target_date DATE,
               status VARCHAR(50) DEFAULT 'active',
               completion_date DATE,
               FOREIGN KEY (user_id) REFERENCES user(user_id) ON DELETE CASCADE,
               FOREIGN KEY (exercise_id) REFERENCES exercise(exercise_id) ON DELETE SET NULL
               )""")

In [23]:
cursor.executemany("""INSERT INTO goals (user_id, goal_type, goal_description, target_value, current_value, unit, exercise_id, start_date, target_date, status)
VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)""", [
    (1, 'PR', 'Bench press 225 lbs', 225.0, 185.0, 'lbs', 1, '2025-09-01', '2025-12-31', 'active'),
    (2, 'bodyweight', 'Lose weight to 145 lbs', 145.0, 152.0, 'lbs', None, '2025-10-01', '2025-11-30', 'active'),
    (1, 'frequency', 'Workout 30 days straight', 30.0, 18.0, 'days', None, '2025-10-01', '2025-11-01', 'active'),
    (3, 'PR', 'Squat 405 lbs', 405.0, 365.0, 'lbs', 2, '2025-08-15', '2025-12-01', 'active'),
    (2, 'PR', 'Do 20 consecutive pull-ups', 20.0, 15.0, 'reps', 3, '2025-09-15', '2026-03-15', 'active')
])
conn.commit()

pd.read_sql("SELECT * FROM goals", conn)

,goal_id,user_id,goal_type,goal_description,target_value,current_value,unit,exercise_id,start_date,target_date,status,completion_date
0,1,1,PR,Bench press 225 lbs,225,185,lbs,1.0,2025-09-01,2025-12-31,active,None
1,2,2,bodyweight,Lose weight to 145 lbs,145,152,lbs,NaN,2025-10-01,2025-11-30,active,None
2,3,1,frequency,Workout 30 days straight,30,18,days,NaN,2025-10-01,2025-11-01,active,None
3,4,3,PR,Squat 405 lbs,405,365,lbs,2.0,2025-08-15,2025-12-01,active,None
4,5,2,PR,Do 20 consecutive pull-ups,20,15,reps,3.0,2025-09-15,2026-03-15,active,None

Create _progress_ table

In [ ]:
cursor.execute("""CREATE TABLE IF NOT EXISTS progress (
               progress_id INTEGER PRIMARY KEY AUTOINCREMENT,
               user_id INT NOT NULL,
               exercise_id INT NOT NULL,
               date DATE NOT NULL,
               period_type VARCHAR(20) NOT NULL,
               max_weight DECIMAL(6,2),
               avg_weight DECIMAL(6,2),
               total_volume DECIMAL(10,2),
               workout_count INTEGER,
               FOREIGN KEY (user_id) REFERENCES user(user_id) ON DELETE CASCADE,
               FOREIGN KEY (exercise_id) REFERENCES exercise(exercise_id) ON DELETE CASCADE
               )""")

In [26]:
cursor.executemany("""INSERT INTO progress (user_id, exercise_id, date, period_type, max_weight, avg_weight, total_volume, workout_count)
VALUES (?, ?, ?, ?, ?, ?, ?, ?)""", [
    (1, 1, '2025-10-07', 'weekly', 185.0, 180.0, 4440.0, 2),
    (1, 1, '2025-10-14', 'weekly', 195.0, 187.5, 4995.0, 2),
    (3, 2, '2025-10-14', 'weekly', 365.0, 365.0, 9125.0, 1),
    (1, 3, '2025-10-16', 'weekly', None, None, 0.0, 1)
])
conn.commit()

pd.read_sql("SELECT * FROM progress", conn)

,metric_id,user_id,exercise_id,date,period_type,max_weight,avg_weight,total_volume,workout_count
0,1,1,1,2025-10-07,weekly,185.0,180.0,4440,2
1,2,1,1,2025-10-14,weekly,195.0,187.5,4995,2
2,3,3,2,2025-10-14,weekly,365.0,365.0,9125,1
3,4,1,3,2025-10-16,weekly,NaN,NaN,0,1
4,5,1,1,2025-10-07,weekly,185.0,180.0,4440,2
5,6,1,1,2025-10-14,weekly,195.0,187.5,4995,2
6,7,3,2,2025-10-14,weekly,365.0,365.0,9125,1
7,8,1,3,2025-10-16,weekly,NaN,NaN,0,1

Create _validation_ table

In [27]:
cursor.execute("""CREATE TABLE IF NOT EXISTS data_validation (
               validation_id INTEGER PRIMARY KEY AUTOINCREMENT,
               user_id INT NOT NULL,
               set_id INTEGER,
               exercise_id INT NOT NULL,
               input_weight DECIMAL(6,2) NOT NULL,
               expected_max DECIMAL(6,2),
               flagged_as VARCHAR(20),
               user_action VARCHAR(20),
               timestamp TEXT DEFAULT (datetime('now')),
               FOREIGN KEY (user_id) REFERENCES user(user_id) ON DELETE CASCADE,
               FOREIGN KEY (set_id) REFERENCES sets(set_id) ON DELETE SET NULL,
               FOREIGN KEY (exercise_id) REFERENCES exercise(exercise_id) ON DELETE CASCADE
               )""")

cursor.executemany("""INSERT INTO data_validation (user_id, set_id, exercise_id, input_weight, expected_max, flagged_as, user_action, timestamp)
VALUES (?, ?, ?, ?, ?, ?, ?, ?)""", [
    (1, 15, 2, 275.0, 205.0, 'outlier', 'corrected', '2025-10-14 18:30:00'),
    (2, None, 3, 95.5, 100.0, 'normal', 'verified', '2025-10-15 19:15:00')
])
conn.commit()

pd.read_sql("SELECT * FROM data_validation", conn)

,validation_id,user_id,set_id,exercise_id,input_weight,expected_max,flagged_as,user_action,timestamp
0,1,1,15.0,2,275.0,205,outlier,corrected,2025-10-14 18:30:00
1,2,2,NaN,3,95.5,100,normal,verified,2025-10-15 19:15:00

Create _workout_plan_ table

In [28]:
cursor.execute("""CREATE TABLE IF NOT EXISTS workout_plan (
               plan_id INTEGER PRIMARY KEY AUTOINCREMENT,
               user_id INT NOT NULL,
               plan_description TEXT,
               plan_type VARCHAR(50),
               number_of_days INTEGER,
               FOREIGN KEY (user_id) REFERENCES user(user_id) ON DELETE CASCADE
               )""")

In [29]:
cursor.executemany("""INSERT INTO workout_plan (user_id, plan_description, plan_type, number_of_days)
VALUES (?, ?, ?, ?)""", [
    (1, 'Push Pull Legs routine for strength', 'PPL', 6),
    (2, 'Full body beginner workout', 'Full Body', 3),
    (3, 'Advanced powerlifting split', 'Upper/Lower', 4)
])
conn.commit()

pd.read_sql("SELECT * FROM workout_plan", conn)

,plan_id,user_id,plan_description,plan_type,number_of_days
0,1,1,Push Pull Legs routine for strength,PPL,6
1,2,2,Full body beginner workout,Full Body,3
2,3,3,Advanced powerlifting split,Upper/Lower,4

Create _daily_plan_ table

In [30]:

# TABLE 14: daily_workout_plan
cursor.execute("""CREATE TABLE IF NOT EXISTS daily_workout_plan (
               daily_plan_id INTEGER PRIMARY KEY AUTOINCREMENT,
               workout_plan_id INT NOT NULL,
               day INT NOT NULL,
               wk_day VARCHAR(50) CHECK (wk_day IN (
                   'Push', 'Pull', 'Legs', 'Upper Body', 'Lower Body', 'Full Body', 
                   'Chest', 'Back', 'Shoulders', 'Arms', 'Core', 'Cardio', 'Rest'
               )),
               session_id INTEGER,
               FOREIGN KEY (workout_plan_id) REFERENCES workout_plan(plan_id) ON DELETE CASCADE,
               FOREIGN KEY (session_id) REFERENCES workout_sessions(session_id) ON DELETE SET NULL
               )""")

In [31]:

cursor.executemany("""INSERT INTO daily_workout_plan (workout_plan_id, day, wk_day, session_id)
VALUES (?, ?, ?, ?)""", [
    (1, 1, 'Push', 1),
    (1, 2, 'Pull', 2),
    (1, 3, 'Legs', 4),
    (1, 4, 'Push', 1), 
    (1, 5, 'Pull', 2), 
    (1, 6, 'Legs', 4),  
    (2, 1, 'Full Body', 3),
    (2, 2, 'Rest', None),     
    (2, 3, 'Full Body', 3), 
    (2, 4, 'Rest', None),
    (2, 5, 'Full Body', 3),  
    (2, 6, 'Rest', None),
    (2, 7, 'Rest', None),
    (3, 1, 'Upper Body', 1),  
    (3, 2, 'Lower Body', 4),  
    (3, 3, 'Rest', None),
    (3, 4, 'Upper Body', 1), 
    (3, 5, 'Lower Body', 4),  
    (3, 6, 'Rest', None),
    (3, 7, 'Rest', None)
])
conn.commit()


pd.read_sql("SELECT * FROM daily_workout_plan", conn)

    daily_plan_id  workout_plan_id  day      wk_day  session_id
0               1                1    1        Push         1.0
1               2                1    2        Pull         2.0
2               3                1    3        Legs         4.0
3               4                1    4        Push         1.0
4               5                1    5        Pull         2.0
5               6                1    6        Legs         4.0
6               7                2    1   Full Body         3.0
7               8                2    2        Rest         NaN
8               9                2    3   Full Body         3.0
9              10                2    4        Rest         NaN
10             11                2    5   Full Body         3.0
11             12                2    6        Rest         NaN
12             13                2    7        Rest         NaN
13             14                3    1  Upper Body         1.0
14             15                3    2  Lower Body         4.0
15             16                3    3        Rest         NaN
16             17                3    4  Upper Body         1.0
17             18                3    5  Lower Body         4.0
18             19                3    6        Rest         NaN
19             20                3    7        Rest         NaN

Verification

In [32]:
cursor.execute("SELECT name FROM sqlite_master WHERE type='table'")
tables = cursor.fetchall()
print(f"Total tables: {len(tables)}")
for table in tables:
    cursor.execute(f"SELECT COUNT(*) FROM {table[0]}")
    count = cursor.fetchone()[0]
    print(f"{table[0]}: {count} rows")

conn.close()

Total tables: 15
user: 3 rows
sqlite_sequence: 14 rows
user_stats_log: 5 rows
exercise: 7 rows
target: 10 rows
exercise_target_association: 13 rows
user_pb: 5 rows
workout_sessions: 4 rows
session_exercises: 7 rows
sets: 22 rows
goals: 5 rows
progress: 8 rows
data_validation: 2 rows
workout_plan: 3 rows
daily_workout_plan: 20 rows